app/views/personal_data/_personal_data.html.slim

SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_data_id` IN (1, 2)
SELECT 1 AS one FROM `employments` WHERE `employments`.`personal_data_id` = 1 LIMIT 1
---

    - if personal_data.employments.any?

SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_data_id` = 1
---
        tbody
          - personal_data.employments.each do |employment|