app/controllers/employments_controller.rb

  def create
    @personalData = PersonalData.find_by(id: employment_params[:personal_data_id])
    employment_params[:employer].each_with_index do |emp, index|
      @employment = Employment.new(employer: emp, date_started: employment_params[:date_started][index], date_ended: employment_params[:date_ended][index])
      @employment.personal_data_id = @personalData.id
      @employment.save
---
SELECT `personal_data`.* FROM `personal_data` WHERE `personal_data`.`id` = 1 LIMIT 1
INSERT INTO `employments` (`employer`, `date_started`, `date_ended`, `personal_data_id`, `created_at`, `updated_at`) VALUES ('AA', '2023-10-27', '2023-10-28', 1, '2023-10-27 04:45:19.865645', '2023-10-27 04:45:19.865645')