app/controllers/personal_data_controller.rb

  def index
    @personalData = PersonalData.includes(:employments).all
---
SELECT `employments`.* FROM `employments` WHERE `employments`.`personal_data_id` IN (1, 2)
SELECT `personal_data`.* FROM `personal_data`

  def create
    @personalData = PersonalData.new(personal_data_params)
    respond_to do |format|
      if @personalData.save
---
INSERT INTO `personal_data` (`first_name`, `last_name`, `nick_name`, `email_address`, `phone_number`, `created_at`, `updated_at`) VALUES ('AA', 'BB', 'AABB', 'aabb@gmail.com', '987-456-3210', '2023-10-27 05:15:29.403451', '2023-10-27 05:15:29.403451')

    def set_personal_data
      @personalData = PersonalData.find(params[:id])
---
SELECT `personal_data`.* FROM `personal_data` WHERE `personal_data`.`id` = 1 LIMIT 1